[
    "Confidential - Oracle Internal OML4Py Client 2.1 on Windows • Install OML4Py Client on Windows • Install the Required Supporting Packages • Get zip and unzip on the Windows • Install OML4Py Client Modules Install OML4Py Client on Windows Learn to install OML 4Py client 2.1 components required for using OML4Py Client on Windows. Installation Overview Step No. Task Description/ What you’ll do 1. Database and System Requirements Ensure your environment meets hardware and software prerequisites for installation. 2. Install Python on Database Server Install Python version 3.12.6. It is required to use the OML4Py 2.1. Topics: Build and Install Python for Windows Build and Install Python for Windows Learn to build and install Python on windows. Confidential - Oracle Internal Note: Python 3.13.2 or higher is required to use OML4Py Client 2.1 on Windows. Steps for downloading and installating Python 3.13.3: 1. Go to the Python website and scroll down to the Files section. Depending on your system type, download the appropriate installer for your Windows machine. Download the installer depending on your windows machine depending on your system types. Choose from : 1. If your Windows system is 64 -bit, download Windows installer (64 -bit). The downloaded file name should be \"python -3.13.2 -amd64\". 2. If your Windows system is 64 -bit, d ownload Windows installer (32 -bit). . The downloaded file name should be \"python -3.13.2 -amd32\". Run the downloaded installer by double -clicking th e file. The following the Python setup screen will appear: <Add image> After running the Python installer: 1. If you check \"Add Python to PATH\": The installer adds the installation directory and its Scripts\\ location to your system's PATH. This lets you to type python to start the interpreter, and pip to install packages directly from the command line. You can then click Install Now and follow the on -screen instructions. Once installation finishes, Python is ready to use. 2. If you leave \"Add Python to PATH\" unchecked: The installer will not update your PATH. This means you’ll need to manually add the installation directory (and the Scripts\\ folder) to the PATH environment variable before you can run python or pip from the command line. To manually modify th e PATH using the directions in Excursus: Setting environment variables . For example, if you installed Python3.13.3 to the default directory C:\\Users\\<YourUsername> \\AppData\\Local\\Programs \\Python\\Pytho n313\\, you can run the following commands to set up environment variable: set PYTHONHOME = C:\\Users\\<YourUsername> \\AppData\\Local\\Programs \\Python\\Pyt hon313\\ set PATH=%PATH%;%PYTHONHOME%;%PYTHONHOME% \\Scripts\\ 2. Install the Required Supporting Packages Confidential - Oracle Internal Learn to install the required supporting packages for installing OML4Py on Windows. These steps outline how to insta ll the required Python packages for installing OML4Py: 1. Create a file named requirements.txt containing the following content: 2. numpy>=2.1.0 3. pandas>=2.2.3 4. scipy>=1.14.1 5. matplotlib>=3.10.0 6. oracledb>=2.4.1 7. pyreadline3>=3.5.4 scikit-learn>1.6.1 8. Install the pack ages with requirements.txt . pip3 install -r requirements.txt You can also install these packages individually. For example to install numpy: pip3 install numpy==2.1.0 Get",
    "up environment variable: set PYTHONHOME = C:\\Users\\<YourUsername> \\AppData\\Local\\Programs \\Python\\Pyt hon313\\ set PATH=%PATH%;%PYTHONHOME%;%PYTHONHOME% \\Scripts\\ 2. Install the Required Supporting Packages Confidential - Oracle Internal Learn to install the required supporting packages for installing OML4Py on Windows. These steps outline how to insta ll the required Python packages for installing OML4Py: 1. Create a file named requirements.txt containing the following content: 2. numpy>=2.1.0 3. pandas>=2.2.3 4. scipy>=1.14.1 5. matplotlib>=3.10.0 6. oracledb>=2.4.1 7. pyreadline3>=3.5.4 scikit-learn>1.6.1 8. Install the pack ages with requirements.txt . pip3 install -r requirements.txt You can also install these packages individually. For example to install numpy: pip3 install numpy==2.1.0 Get zip and unzip on the Windows http://stahlworks.com/dev/zip.exe http://stahlworks.com/dev/unzip.exe During the instal lation of OML4Py, both zip and unzip utilities are necessary. zip and unzip commands are required to pack and unpack files during setup while running automated scripts. To verify whether zip and unzip are installed, open Command Prompt (cmd.exe) and type zip and unzip respectively. If you receive a message like \"'zip' is not recognized as an internal or external command, operable program or batch file\", then follow the instructions to download zip and unzip: 1. Download zip and unzip. Note : No installation is required. 2. Navigate to the folder where these two .exe files are stored. Create two folders named \"Zip\" and \"Unzip\" and move the .exe files to the new folders respectively. The path to the .exe files should be similar to: <path_to_dir> \\Zip\\zip.exe<path _to_dir> \\Unzip\\unzip.exe Confidential - Oracle Internal 3. To enable command \"zip\" and \"unzip\" on the Command Line, open your Command Prompt (CMD) and type: 4. setx PATH \"%PATH%;<download_directory> \\Unzip\\\" 5. setx PATH \"%PATH%;<download_directory> \\Zip\\\" For example, if the zip.exe is store d in location \"D: \\Zip\\zip.exe\" and the unzip.exe is stored in location \"D: \\Unzip \\unzip.exe\" then the set PATH commands should be: setx PATH \"%PATH%;D: \\Unzip\\\" setx PATH \"%PATH%;D: \\Zip\\\" 6. Restart your cmd and type: echo %PATH% At the end of the PATH, y ou will see \"D: \\Unzip;D: \\Zip\". 7. Type \"Zip\" or \"Unzip\" to see a list of available commands Install OML4Py Client Modules Learn about the steps to install OML4Py Client on Windows with step -by-step instructions. . Download and extract the OML4Py client installation zip file, do the following: 1. Download the client installation zip file. 1. Go to the Oracle Machine Learning for Python Downloads page on the Oracle Technology Network. 2. Accept the license agreement an d select Oracle Machine Learning for Python Downloads (v2.1). 3. Select Oracle Machine Learning for Python Client Install for Oracle Database on Linux 64 bit. 4. Save the zip file to an accessible directory. 2. Go to the directory to which you downloaded the zip fi le and unzip the file. Copy unzip v1048628 -01.zip The contents are extracted to a subdirectory named client , which contains these four files: Confidential - Oracle Internal o OML4PInstallShared.pm o oml-2.1-cp312-cp312-linux_x86_64.whl o client.pl o oml4py.ver .",
    "agreement an d select Oracle Machine Learning for Python Downloads (v2.1). 3. Select Oracle Machine Learning for Python Client Install for Oracle Database on Linux 64 bit. 4. Save the zip file to an accessible directory. 2. Go to the directory to which you downloaded the zip fi le and unzip the file. Copy unzip v1048628 -01.zip The contents are extracted to a subdirectory named client , which contains these four files: Confidential - Oracle Internal o OML4PInstallShared.pm o oml-2.1-cp312-cp312-linux_x86_64.whl o client.pl o oml4py.ver ."
]